
### :robot: Terraform Report
---
##### Plan: `15` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.repository["cf-python-example"] will be created
  + resource "google_artifact_registry_repository" "repository" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + effective_labels       = {
          + "project" = "cf-python-example"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "project" = "cf-python-example"
        }
      + location               = "europe-west1"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "lille-zenbox-adeo-2024"
      + repository_id          = "cf-python-example"
      + terraform_labels       = {
          + "project" = "cf-python-example"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete snapshot"

          + condition {
              + older_than            = "60000s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep version"

          + condition {
              + package_name_prefixes = [
                  + "cf-python-example",
                ]
              + tag_prefixes          = [
                  + "dev",
                ]
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (2 unchanged attributes hidden)
            }
        }
    }

  # google_storage_bucket.bucket["lille-zenbox-adeo-2024-cf-python-example"] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "project" = "example"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "project" = "example"
        }
      + location                    = "EUROPE-WEST1"
      + name                        = "lille-zenbox-adeo-2024-cf-python-example"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + terraform_labels            = {
          + "project" = "example"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + method = [
              + "*",
            ]
          + origin = [
              + "*",
            ]
        }

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 30
              + matches_prefix         = [
                  + "test",
                ]
              + matches_storage_class  = []
              + matches_suffix         = []
              + send_age_if_zero       = true
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }
      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 36135
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + send_age_if_zero       = true
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }
      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + num_newer_versions     = 3
              + send_age_if_zero       = true
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.bucket_sa_role.google_project_iam_member.global_role["roles/cloudfunctions.admin,serviceAccount:cf-python-example-sa@lille-zenbox-adeo-2024.iam.gserviceaccount.com"] will be created
  + resource "google_project_iam_member" "global_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cf-python-example-sa@lille-zenbox-adeo-2024.iam.gserviceaccount.com"
      + project = "lille-zenbox-adeo-2024"
      + role    = "roles/cloudfunctions.admin"
    }

  # module.bucket_sa_role.google_storage_bucket_iam_member.role_bucket["lille-zenbox-adeo-2024-cf-python-example,roles/storage.objectAdmin,serviceAccount:cf-python-example-sa@lille-zenbox-adeo-2024.iam.gserviceaccount.com"] will be created
  + resource "google_storage_bucket_iam_member" "role_bucket" {
      + bucket = "lille-zenbox-adeo-2024-cf-python-example"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:cf-python-example-sa@lille-zenbox-adeo-2024.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.github_oidc.google_iam_workload_identity_pool.pool will be created
  + resource "google_iam_workload_identity_pool" "pool" {
      + description               = "Workload Identity Pool for github-action"
      + disabled                  = false
      + display_name              = "github-action-pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "585501833219"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-action"
    }

  # module.github_oidc.google_iam_workload_identity_pool_provider.provider will be created
  + resource "google_iam_workload_identity_pool_provider" "provider" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.ref"        = "assertion.ref"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "Workload Identity Pool Provider for github-action-provider"
      + display_name                       = "github-action-provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "585501833219"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-action"
      + workload_identity_pool_provider_id = "github-action-provider"

      + oidc {
          + allowed_audiences = []
          + issuer_uri        = "https://token.actions.githubusercontent.com"
        }
    }

  # module.github_oidc.google_project_iam_member.sa["roles/editor"] will be created
  + resource "google_project_iam_member" "sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "585501833219"
      + role    = "roles/editor"
    }

  # module.github_oidc.google_project_iam_member.sa["roles/iam.workloadIdentityUser"] will be created
  + resource "google_project_iam_member" "sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "585501833219"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.github_oidc.google_project_service.service["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.github_oidc.google_project_service.service["iam.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "iam.googleapis.com"
    }

  # module.github_oidc.google_project_service.service["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.github_oidc.google_project_service.service["sts.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "sts.googleapis.com"
    }

  # module.github_oidc.google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "github-action"
      + description  = "Service account used by github-action"
      + disabled     = false
      + display_name = "github-action"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "585501833219"
      + unique_id    = (known after apply)
    }

  # module.github_oidc.google_service_account_iam_member.principal["python-example"] will be created
  + resource "google_service_account_iam_member" "principal" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.github_oidc.google_service_account_iam_member.sa["ladiesdiv"] will be created
  + resource "google_service_account_iam_member" "sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#10736298099`](https://github.com/LADIESDIV/tf-example/actions/runs/10736298099) - commit 8e0b4560bd8ff3755b65959b65b35aa5737a8561
